; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	infrared0 - mode
	image1 - mode
	GroundStation0 - direction
	GroundStation3 - direction
	Star4 - direction
	Star2 - direction
	GroundStation1 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Planet17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star2)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon5)
)
(:goal (and
	(have_image Phenomenon5 infrared0)
	(have_image Planet6 image1)
	(have_image Star7 infrared0)
	(have_image Phenomenon8 infrared0)
	(have_image Phenomenon9 image1)
	(have_image Star10 image1)
	(have_image Star11 infrared0)
	(have_image Phenomenon12 image1)
	(have_image Star13 infrared0)
	(have_image Phenomenon14 infrared0)
	(have_image Phenomenon15 infrared0)
	(have_image Planet16 infrared0)
	(have_image Planet17 infrared0)
	(have_image Star18 infrared0)
))

)

; plan
1. (turn_to satellite0 star2 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star2)
   goals met: 0 of 14
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 14
3. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 14
4. (turn_to satellite0 phenomenon9 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon9)
   goals met: 0 of 14
5. (take_image satellite0 phenomenon9 instrument0 image1)
   added: (have_image phenomenon9 image1)
   goals met: 1 of 14
6. (turn_to satellite0 phenomenon8 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon8)
   goals met: 1 of 14
7. (take_image satellite0 phenomenon8 instrument0 infrared0)
   added: (have_image phenomenon8 infrared0)
   goals met: 2 of 14
8. (turn_to satellite0 phenomenon5 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon5)
   goals met: 2 of 14
9. (take_image satellite0 phenomenon5 instrument0 infrared0)
   added: (have_image phenomenon5 infrared0)
   goals met: 3 of 14
10. (turn_to satellite0 phenomenon15 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon15)
   goals met: 3 of 14
11. (take_image satellite0 phenomenon15 instrument0 infrared0)
   added: (have_image phenomenon15 infrared0)
   goals met: 4 of 14
12. (turn_to satellite0 phenomenon14 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon14)
   goals met: 4 of 14
13. (take_image satellite0 phenomenon14 instrument0 infrared0)
   added: (have_image phenomenon14 infrared0)
   goals met: 5 of 14
14. (turn_to satellite0 phenomenon12 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon12)
   goals met: 5 of 14
15. (take_image satellite0 phenomenon12 instrument0 image1)
   added: (have_image phenomenon12 image1)
   goals met: 6 of 14
16. (turn_to satellite0 planet16 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet16)
   goals met: 6 of 14
17. (take_image satellite0 planet16 instrument0 infrared0)
   added: (have_image planet16 infrared0)
   goals met: 7 of 14
18. (turn_to satellite0 planet17 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet17)
   goals met: 7 of 14
19. (take_image satellite0 planet17 instrument0 infrared0)
   added: (have_image planet17 infrared0)
   goals met: 8 of 14
20. (turn_to satellite0 planet6 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 planet6)
   goals met: 8 of 14
21. (take_image satellite0 planet6 instrument0 image1)
   added: (have_image planet6 image1)
   goals met: 9 of 14
22. (turn_to satellite0 star10 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star10)
   goals met: 9 of 14
23. (take_image satellite0 star10 instrument0 image1)
   added: (have_image star10 image1)
   goals met: 10 of 14
24. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 10 of 14
25. (take_image satellite0 star11 instrument0 infrared0)
   added: (have_image star11 infrared0)
   goals met: 11 of 14
26. (turn_to satellite0 star13 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star13)
   goals met: 11 of 14
27. (take_image satellite0 star13 instrument0 infrared0)
   added: (have_image star13 infrared0)
   goals met: 12 of 14
28. (turn_to satellite0 star18 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star18)
   goals met: 12 of 14
29. (take_image satellite0 star18 instrument0 infrared0)
   added: (have_image star18 infrared0)
   goals met: 13 of 14
30. (turn_to satellite0 star7 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 star7)
   goals met: 13 of 14
31. (take_image satellite0 star7 instrument0 infrared0)
   added: (have_image star7 infrared0)
   goals met: 14 of 14
